app/controllers/application_controller.rb

    def set_current_user ##rails looks for index.html.erb file inside views in about folder
        if(session[:user_id])
            #@user=User.find(session[:user_id]) #find is used when we are sure we will find this is
            # @user=User.find_by(id: session[:user_id])
            Current.user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]