app/controllers/password_reset_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$Y13EVhySV6fte.21Vc5Rye4bLoleB0wl1jTyoK0koM6XzgYD77rei"], ["updated_at", "2021-05-06 13:50:52.104438"], ["id", 5]]
---
    def update
        @user=User.find_signed!(params[:token],purpose: "edit_password_reset")
        if @user.update(password_params)