app/controllers/registrations_controller.rb

    def create
        @user=User.new(user_params)
        #@user=User.new(params[:user])
        #@user=User.new(email: "ftgyhuj", password: "fghj")
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)